Courses/4420/Lectures/Fortification/Forensics/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linux Forensics [WIP]</title>
<!-- 2018-11-01 Thu 20:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">Linux Forensics [WIP]</h1>
<ol class="org-ol">
<li>No networking related forensics is covered.
</li>
</ol>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Live Response</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Talk to the Humans</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>What do they think happened
</li>
<li>Details on victim system(s)
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Mount Response Kit with Known Good Tools</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>cdrom preferred as it was not likely part of compromise
</li>
<li>USB MS can be used if no CDROM
</li>
<li>Using netcat to minimize contamination
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Collecting Volatile Data</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>date and time
</li>
<li>network interfaces 
</li>
<li>funny networks
</li>
<li>promiscuous mode?
</li>
<li>network connections
</li>
<li>open ports
</li>
<li>programs associated with ports
</li>
<li>running processes
</li>
<li>open files
</li>
<li>routing tables
</li>
<li>mounted filesystems
</li>
<li>loaded kernel modules
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Dead Analysis Justified?</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>kernel version
</li>
<li>uptime
</li>
<li>filesystem datetime stamps
</li>
<li>hash values for system files
</li>
<li>current user logins
</li>
<li>login history
</li>
<li>system logs
</li>
<li>user accounts
</li>
<li>user history files
</li>
<li>hidden files and directories
</li>
<li>sending off suspicious files for further study
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Dumping RAM</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Making the decision to dump RAM
</li>
<li>Using fmem <a href="https://github.com/NateBrune/fmem">https://github.com/NateBrune/fmem</a> Linux Kernel Module designed to help analyze volatile memory in the linux kernel
</li>
<li>Using LiME <a href="https://github.com/504ensicsLabs/LiME">https://github.com/504ensicsLabs/LiME</a> A Loadable Kernel
Module (LKM) which allows for volatile memory acquisition from
Linux and Linux-based devices, such as Android. This makes LiME
unique as it is the first tool that allows for full memory captures
on Android devices. It also minimizes its interaction between user
and kernel space processes during acquisition, which allows it to
produce memory captures that are more forensically sound than those
of other tools designed for Linux memory acquisition.
</li>
<li>Using <code>/proc/kcore</code>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Acquiring Filesystem Images</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Using dd
</li>
<li>Using dcfldd <a href="https://www.forensicswiki.org/wiki/Dcfldd">https://www.forensicswiki.org/wiki/Dcfldd</a>
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Write Blocking Options</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Forensic Linux distros
</li>
<li>Udev rules based blocker
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Analyzing Filesystem Images</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Mounting images</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Files with basic system info
</li>
<li>Files with suspicious user info
</li>
<li>Examining logs
</li>
<li>Process-related files
</li>
<li>Authentication-related files 
</li>
<li>Using standard Linux tools to find information
</li>
<li>Strange files
<ol class="org-ol">
<li>Regular files in /dev
</li>
<li>User history files
</li>
<li>Hidden files
</li>
<li>SUID/SGID files
</li>
<li>Detecting backdated files
</li>
</ol>
</li>
<li>Recovering deleted files
<ol class="org-ol">
<li>Finding deleted files
</li>
<li>Attempting recovery
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Leveraging The Sleuth Kit (TSK) and Autopsy</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li><a href="https://www.sleuthkit.org/autopsy/">https://www.sleuthkit.org/autopsy/</a>
</li>
<li>mmls
</li>
<li>fsstat
</li>
<li>dstat
</li>
<li>istat
</li>
<li>fls &amp; mactime
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Timeline Analysis</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>When was system installed, upgraded, booted, etc.
</li>
<li>Newly created files (malware)
</li>
<li>Changed files (trojans)
</li>
<li>Files in the wrong place (exfiltration)
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Digging Deeper into Linux Filesystems</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Disk editors
<ol class="org-ol">
<li>Active@ Disk Editor
</li>
<li>Autopsy
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Ext4/3/2/1</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Basics
</li>
<li>Superblocks
</li>
<li>Directory entries
</li>
<li>Inodes
</li>
<li>Data blocks
</li>
<li>Compatible, incompatible, and read-only compatible features
</li>
<li>Experimental features may be installed
</li>
<li>Boot code
</li>
<li>Using sigfind to find important blocks
</li>
<li>Understanding indirect block levels
</li>
<li>istat, ils, ifind, icat
</li>
<li>Links and mounts
</li>
<li>Hash trees
</li>
<li>Journaling
</li>
<li>jls
</li>
<li>jcat
</li>
<li>Finding data with blkstat, blkls, blkfind, blkid, and blkcalc
</li>
<li>Relating data found with grep to a file/application
</li>
<li>Finding block size, etc.
</li>
<li>Using grep with a keyword file
</li>
<li>Seeing data in context
</li>
<li>Associating a file with the data
</li>
<li>Undeleting files
</li>
<li>Searching unallocated space
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Network Forensics</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Using snort on packet captures
</li>
<li>Using tcpstat
</li>
<li>Seperating conversations with tcpflow
</li>
<li>Tracing backdoors with tcpflow
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> File Forensics</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>Using file signatures
</li>
<li>Searching through swap space
</li>
<li>Web browsing reconstruction
</li>
<li>Cookies
</li>
<li>Search history
</li>
<li>Browser caches
</li>
<li>Unknown files
</li>
<li>Comparing hashes to know values
</li>
<li>File command
</li>
<li>Strings command
</li>
<li>Viewing symbols with nm
</li>
<li>Reading ELF files 
</li>
<li>objdump
</li>
<li>Bringing out big guns - gdb
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Memory Forensics</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>Volatility Profiles
</li>
<li>Retrieving process information
</li>
<li>Recovering command line arguments
</li>
<li>Rebuilding environment variables
</li>
<li>Listing open files
</li>
<li>Retrieving bash information
</li>
<li>Reconstructing network artifacts
</li>
<li>Kernel information
</li>
<li>Volatile file system information
</li>
<li>Detecting user mode rootkits
</li>
<li>Detecting kernel rootkits
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Reversing Linux Malware</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>What is "reversing"?
</li>
<li><a href="https://github.com/michalmalik/linux-re-101">https://github.com/michalmalik/linux-re-101</a> 2018 {pm: Pretty good.}
</li>
<li>JD-GUI is a standalone graphical utility that displays Java source
codes of “.class” files.
</li>
<li><a href="https://unix.stackexchange.com/questions/418354/">https://unix.stackexchange.com/questions/418354/</a>
   understanding- what-a- linux- binary- is-doing
</li>
<li>Tools: IDA and Radare
</li>
</ol>
</div>

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Digging deeper into ELF</h3>
<div class="outline-text-3" id="text-9-1">
<ol class="org-ol">
<li>Headers
</li>
<li>Sections
</li>
<li>Strings
</li>
<li>Symbol tables
</li>
<li>Program headers
</li>
<li>Program loading
</li>
<li>Dynamic linking
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Command line analysis tools</h3>
<div class="outline-text-3" id="text-9-2">
<ol class="org-ol">
<li>strings
</li>
<li>strace
</li>
<li>ltrace
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Running malware (carefully)</h3>
<div class="outline-text-3" id="text-9-3">
<ol class="org-ol">
<li>Virtual machine setup
</li>
<li>Capturing network traffic
</li>
<li>Leveraging gdb
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Writing the Reports</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>Autopsy <a href="https://www.sleuthkit.org/autopsy/">https://www.sleuthkit.org/autopsy/</a> Autopsy® is a digital
forensics platform and graphical interface to The Sleuth Kit® and
other digital forensics tools.
</li>
<li><a href="https://tools.kali.org/reporting-tools/dradis">https://tools.kali.org/reporting-tools/dradis</a> Dradis is an open source framework to enable effective
information sharing, specially during security assessments. Dradis
is a self-contained web application that provides a centralized
repository of information to keep track of what has been done so
far, and what is still ahead.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> References</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>Prabhaker Mateti, Notes on Building Provenance into Linux and
Android, 2018.
</li>
<li><a href="https://www.forensicswiki.org/">https://www.forensicswiki.org/</a>
</li>
<li><a href="https://opensource.com/article/18/4/linux-filesystem-forensics">https://opensource.com/article/18/4/linux-filesystem-forensics</a> 2018
Breach detection with Linux Filesystem Forensics
</li>

<li><a href="http://www.deer-run.com/~hal/LinuxForensicsForNon-LinuxFolks.pdf">http://www.deer-run.com/~hal/LinuxForensicsForNon-LinuxFolks.pdf</a>
</li>

<li><a href="https://www.pentesteracademy.com/course?id=20">https://www.pentesteracademy.com/course?id=20</a> Linux
Forensics. Ack: Topic list shown above is from here.
</li>
<li><a href="https://rada.re/r/">https://rada.re/r/</a>  Radare is a portable reversing framework.
</li>
<li><a href="https://www.hex-rays.com/products/ida/">https://www.hex-rays.com/products/ida/</a> "IDA is a Windows, Linux or
Mac OS X hosted multi-processor disassembler and debugger that
offers so many features it is hard to describe them all. Just grab
an evaluation version if you want a test drive."
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> End</h2>
<div class="outline-text-2" id="text-12">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-11-01
</div>
</body>
</html>
